<template>
	<view class="page">
		<view>
			<p>您使用我们的服务时，我们将会根据本协议隐私政策收集、储存、使用和对外提供您的信息。同时，我们会通过本协议隐私政策向您说明，我们是如何为您提供收集、使用和保护您的信息的服务。鉴于本协议隐私政策内容与您使用我们的服务密切相关，同时也是为了保障您自身的合法权益，希望您仔细阅读并理解本协议隐私政策全部内容，对于本政策协议中与您的权益有重大关系的条款和个人敏感信息，我们将采用粗体字进行标注以提示您的注意。</p>
			<br/><br/><b>第1条、信息收集及其目的</b><br/><br/>
			<p>1.在您注册和登录使用时，您需要提供您的电话号码作为登录名。<text style="font-weight: bold">服务商注册时须提供授权使用人姓名、手机号码、身份证号、银行卡信息、营业执照及开户许可证复印件，并填写相关登记信息；商户注册时须提供姓名、手机号码、身份证号、银行卡信息。收集这些信息主要是为您提供账号登录服务以及保障您的账号安全，如您无法提供前述信息，可能无法进行注册和使用本服务。</text></p>
			<p>2.登录验证时，我们可能会向您提供多种身份验证方式，您可以选择登录密码、短信验证、指纹验证、脸部识别验证等方式。对于指纹验证和脸部识别验证，我们仅接收验证结果，并不会收集您的指纹信息和面容ID信息，如您不想使用指纹和脸部识别验证方式，仍可以使用其他验证方式。我们会将上述信息提交给合法持有您上述信息的第三方身份验证机构，以便对您提供的信息准确性进行核对，如您的信息未能验证通过，则无法使用我们的服务。</p>
			<p style="font-weight: bold">3.为了保障向您提供的服务安全稳定地运行，预防交易和资金安全，我们需要记录您使用本协议服务类别、方式及设备型号、IP地址、设备软件版本信息、设备识别码、设备识别符、所在地区、网络使用习惯及其他与本协议相关的日志信息。如您不同意我们记录前述信息，可能无法完成风险验证。</p>
			<p>4.APP权限获取说明:</p>
			<p style="font-weight: bold">(1)读写手机存储(其目的在于读写手机照片及文件)</p>
			<p style="font-weight: bold">(2)常驻通知(允许应用发送常驻通知或短信提醒)</p>
			<p style="font-weight: bold">(3)定位(通过网络或卫星对您的位置信息进行采集并记录)</p>
			<p style="font-weight: bold">(4)读取应用列表(获取手机上已安装的应用信息)</p>
			如果您想更改您的授权范围，可以通过手机权限设置及本服务APP“设置相关-资费相关/隐私相关/多媒体相关”修改授权范围，当您取消信息收集的授权后，我们将不再收集该信息，但请您理解并注意，为了保障本服务的正常提供，部分功能可能无法自选关闭。
			<p>5.根据相关法律法规及国家标准，在以下情形中，我们可能会依法收集并使用您的个人信息而无需征得您的同意:</p>
			<p style="font-weight: bold">(1)与履行国家法律法规及行业主管部门有关规定的义务相关的;</p>
			<p style="font-weight: bold">(2)与国家安全、国防安全直接相关的;</p>
			<p style="font-weight: bold">(3)与公共安全公共卫生、重大公共利益直接相关的;</p>
			<p style="font-weight: bold">(4)与犯罪侦查、起诉、审判和判决执行等直接相关的;</p>
			<p style="font-weight: bold">(5)处于维护您或他人的生命、财产等重大合法权益但又很难得到您本人同意的;</p>
			<p style="font-weight: bold">(6)所收集的个人信息是您自行向社会公众公开的;</p>
			<p style="font-weight: bold">(7)从合法公开披露的信息中收集个人信息，例如:合法的新闻报道、政府信息公开等渠道;</p>
			<!-- <p style="font-weight: bold">(8)从合法公开披露的信息中收集个人信息，例如:合法的新闻报道、政府信息公开等渠道;</p> -->
			<p style="font-weight: bold">(8)根据您的要求签订和履行合同所必需的;</p>
			<p style="font-weight: bold">(9)用于维护所提供的服务的安全稳定运行所必需的，例如:发现、处置服务的故障，识别、处置金融产品或服务中的欺诈或被盗用。</p>
			<br/><b>第2条、信息使用</b><br/><br/>
			<p>1.为了保障本服务的安全性与稳定性保护您的资金与账户安全，履行反洗钱等法定义务，我们会将您的信息用于身份验证、安全范范、诈骗/盗用/可疑交易监测、预防或禁止非法活动、降低风险及防治风险传导、存档和备份用途。</p>
			<p>2.依据法律法规或强制性的行政和司法要求。</p>
			<p>3.为了使您知晓本协议服务的状态，我们会向您发送服务提醒，如您不需要此提醒，可向我们线上客服或人工客服申请关闭。</p>
			<p>4.我们不会向任何无关第三方提供、出售、出租、分享或交易您的信息，除非事先得到您的同意，或该第三方单独或与我们共同为您提供本协议某些产品或服务。同时，我们将评估第三方收集信息的合法性、正当性、必要性，我们将要求第三方对您的信息采取保护措施。</p>
			<br/><b>第3条、信息保护</b><br/><br/>
			<p>1.请您妥善保管好您的账户密码及身份信息。您在使用本服务时，我们将通过您的账户密码及其他身份信息来识别您的身份，一旦您泄露了前述信息，您可能会蒙受损失，并可能对您产生不利。如您发现您的账户密码或其他身份信息可能/已经泄露时，请立即与我们联系，我们将采取相关措施避免/降低您的相关损失。</p>
			<p>2.我们将根据法律法规及监管部门的要求，对您的身份信息及交易信息进行收集、使用、存储和处理。</p>
			<p>3.在您停止使用本服务时，我们将停止对您的信息的收集和使用，法律法规或监管部门另有规定的除外。如我们停止运营，我们将及时停止收集您的个人信息，并将所持有的您的信息进行删除或匿名化处理。</p>
			<br/><b>第4条、隐私政策的更新因法律法规及监管部门政策的发布/修改或公司自身业务发展需要，我们可能会对本协议隐私政策进行更新。对于更改内容或更新后的隐私政策，我们将会以弹窗提示、推送通知、邮件、短信或在官网发布公告等方式来通知您。为了使您能够及时接收到通知，建议您在联系方式更换时及时通知我们。如您在本服务协议更新后仍继续使用本服务，即表示您已充分阅读、理解并接收更新后的政策，并愿意受更新后的政策约束。</b>
			<br/><br/><b>第5条、其他</b><br/><br/>
			<p>本协议隐私政策未涉及条款以您与我们签订的合作协议或本服务《注册协议》、《用户信息保护及授权协议》为准。</p>
			<br/><br/><b>第6条、APP信息和开发者信息</b><br/><br/>
			<p>应用名称:【{{config.appName}}】</p>
			<p>应用主体名称:【{{config.companyName}}】</p>
		</view>
		<up-button type="primary" style="width: 100%; margin: 50rpx auto;" @click='btnClick'>同意该协议</up-button>
	</view>
</template>

<script setup>
	import { reactive, ref, onMounted, toRefs, unref, inject} from 'vue'
	import config from "@/config/index.js"
  const btnClick = () => {
		uni.navigateBack();
	}
</script>

<style lang="scss" scoped>
	.page{
		background-color: #FFFFFF;
		padding: 32rpx;
		font-size: 28rpx;
	}
</style>
