<template>
	<view class="page">
		<view>
			<p>感谢您选择“{{config.appName}}” APP，本协议是《特约商户专业化服务合作协议》或《支付业务拓展服务协议》(以下简称“代理协议”)的有效组成部分。为了保障您的权益，请您于本服务开通前，详细阅读本协议条款的所有内容。
			</p><br/><br/><b>第1条 本注册协议的确认</b><br/><br/>
			<p>1.请您仔细阅读本协议内容，尤其是字体加粗部分、义务条款、特殊条款以及免责条款，如您对本协议内容或页面提示信息有疑问，请勿进行下一步操作。您可通过"店管家”在线客服进行咨询，以便我们为您解释和说明。您通过页面点击或其他方式确认即表示您已同意本协议。</p>
			<p>2.您了解并同意，本公司有权随时对本协议内容进行单方面的变更，并以在本网站公告的方式予以公布，无需另行单独通知，若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务，若您不同意修改后的协议内容，应停止使用本服务。</p>
			<p>3.您须确保在注册本服务平台APP时已与本公司签署代理协议。并承诺遵守《中华人民共和国反洗钱法》、《银行卡收单业务管理办法》、《非金融机构支付服务管理办法》 《银行卡收单外包业务自律规范》等相关法律法规规章制度规定。</p><br/><br/>
			<b>第2条 账户注册、使用和注销</b><br/><br/>
			<p>(1)您如实以本人身份信息进行注册，自然人或外包服务机构仅限注册一个账户。如账户注册需提供所属外包服务机构公司信息，请您保证填写的公司信息与向本公司提交的公司信息一致。</p>
			<p>(2)您在用户识别或账户中设置的昵称、头像等请务必遵守法律法规、公序良俗、社会公德，且不会侵害其他第三方的合法权益，否则我们可能会取消您的昵称、头像。</p>
			<br/>2. 使用
			<p>(1)确认，商户管理员及登录人为您的全权授权代表，其在本服务平台上完成的操作与行为均视为您的真实意思表示，您对于通过您方商户账号、登录人账号和相关密码在本服务平台上的一切操作行为承担责任。</p>
			<p>(2)您确认使用本服务进行的操作、发出的指令视为您所属的外包服务机构一致行为。因您的原因造成本服务账户、密码等信息被冒用、盗用或非法使田 由出2起的风险和塌生重要出会 户、密码等信息被冒用、盗用或非法使用，由此引起的风险和损失需要由您所属的外包服务机构承担。</p>
			<p>(3)本服务账户不得私下转让、售卖、赠与或授意他人使用。</p>
			<p>(4)为了保障您的资金安全，请把手机及其他设备的密码设置成与本服务账户或密码不一致。如您发现有人冒用或盗用您的账户及密码，请您立刻以有效方式通知我们，您可以向我们申请暂停或停止本服务。</p>
			<p>(5)基于运行和功能实现的需要，我们可能会暂停或者限制部分功能，或者增加新的功能。</p>
			<br/>3. 注销
			<p>(1)人式申请注销 本服务账户。</p>
			<p>(2)如您与本公司签署的代理协议期限届 满、已签署《退出承诺函》、且您与本公司之间不存在任何因代理关系产生的纠纷事宜，则本公司将注销您名下的本协议账户。</p>
			<p>(3)如您提供虚假资料、不实身份或违反上述规定取得的本服务账号，本公司将注销您名下的本协议账户。</p>
			<p>(4)如您恶意毁本公司声誉涉及虚假宣传及不正当竞争等违反本服务协议或已签署的代理协议，本公司将注销您名下的本协议账户。</p>
			<p>(5)公司声誉涉及虚假 宣传及不正当竞争等违反本服务协议或已签署的代理协议，本公司将注销您名下的本协议账户。</p>
			<br/><b>第3条 您的义务</b><br/><br/>
			<p>1.您需为其发展的商户办理必要的资格 审核手续，收集签约资料，为入驻商户办理业务变更、终止申请和续费等相关手续，为入驻商户开展业务培训，并提供必要的业务咨询、日常维护和技术支持服务。 您在进行市场拓展时，若违反以下条款，则本公司有权采取暂停分润、强制交纳保证金、解除代理协议、注销本服务账户、罚款等一种或多种方式进行解决:</p>
			<p>(1)您应严格按照本公司提供的产品资料进行商户拓展，不得欺骗、误导商户，不得对产品的用途、性能、价格、规格等做夸大、失实的宣传。</p>
			<p>(2)您在开展业务时，应如实解释您与本公司之间的关系，未经书面授权，不得以本公司“办事处”或“总代理”等具有垄断性、排他性的名义进行广告宣传、商业活动及其他非代理协议目的之活动。</p>
			<p>(3)您不得以任何人名义向他人收取费用为其申请本服务账户。</p>
			<p>(4)您须严格遵守《关于加强受理终端管理防范网上违规宣传和售卖受理终端的风险提示》，不得违规网络售卖本公司产品，亦不得宣传“低费率”、“零费率”、“商户自选”等违法违规业务。</p>
			<p>(5)您与本公司合作期间，不得从事任何与本公司支付业务有竞争关系的第三方产品或服务的经营、不得向本公司商户进行第三方产品或服务的营销。您不得将本公司提供的支付服务用于约定用途之外的，包括但不限于提供给任何第三方使用、随意挪动至非约定的营业地点、将其他商户交易假冒本商户交易，无真实商品标的或服务标的的交易。</p>
			<p>(6)您不得侵犯本公司知识产品及商业秘密。</p>
			<p>(7)您不得故意诋毁或损害本公司声誉。</p>
			<p>(8)您不得以不正当竞争行为进行市场拓展、不得违法违规开展支付服务。</p>
			<p>(9)其他签署协议的相关条款。您须对其拓展商户违法违规行为承担连带赔偿责任。</p>
			<p>(10)您在开展业务过程中，应严格按照本公司的有关规定和要求，每月对入网特约商户的履约情况和业务动态进行监督和检查，如发现入驻特约商户的业务有违反国家法律、法规规定或本协议约定的，应在及时向本公司履行告知义务的同时立即暂停违规特约商户的支付服务，并应本公司要求配合处理相关事宜。同时，您应及时收缴已终止服务特约商户的终端设备。</p>
			<br/><b>第4条 特殊条款</b><br/><br/>
			<p>1.自商户成功激活本公司终端之日起90日内可免费使用终端流量卡，自第91日起每台终端将按照36元/年的收费标准收取流量卡服务费，每12个月为一个计付周期。本公司自第91日起将从商户首笔>100元的非扫码交易中扣除第一年度流量卡服务费，以后各次流量卡服务费将于上次周期届满前90日从商户首笔≥100元的非扫码交易中扣除。</p>
			<p>2.保险金:为保障您的交易资金安全，本服务平台现已推出24小时延迟赔付，交易资金安全保障快速理赔”保险服务供您选择。若您在本服务平台--“资金保障服务”页面--"我已阅读《资金保障服务》协议并同意开通”为勾选状态，则视为您认可并自愿参与该保险服务，本公司将根据《资金保障服务协议》约定对于您的每笔交易额扣除相应保险费。若您不需要此保险服务，请您确保本服务平台“资金保障服务"页面--“我已阅读《资金保障服务》协议并同意开通”为未勾选状态。</p>
			<br/><b>第5条 免责条款</b><br/><br/>
			<p>1.病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵或政府行为等原因，造成本公司不能提供服务的;</p>
			<p>2.本公司系统停机维护或升级;</p>
			<p>3.您的手机或移动设备软件、系统、硬件和通信线路出现故障;</p>
			<p>4.因下列状况之一导致本公司系统无法正常运作，使您无法使用本服务时，本公司不负任何赔偿责任:</p>
			<p>5.因硬件、操作系统、数据库、开发工具本身固有的技术缺陷而引起数据受损或被窃取的;</p>
			<p>6.您操作不当或通过非本公司授权或认可的方式使用本服务;</p>
			<br/><b>第6条 其他</b><br/><br/>
			<p>1.务效为1年，自服务开通之日起计算。有效期满后若双方均无异议，本服务自动顺延相同期限，以此类推，且您应在到期日前一个月提供更新年检的各项证照，若任何一方拒绝续展，应在本服务到期日前一个月书面通知对方。</p>
			<p>2.您应及时向本公司申报如下变更事项，如因您原因，本公司未收到变更通知产生的风险和损失，您需承担相关责任:</p>
			<p>(1)名称、负责人、地址、经营许可证号、联系方式、银行账号等事项的变更。</p>
			<p>(2)所有权结构变更、业务经营或销售方式有重大变动。出现这种变更，您应及时书面通知本公司，本公司有权选择是否终止本协议。</p>
			<p>3.如您在签订、履行本合同时给本公司造成经济损失，您的法定代表人/负责人自愿以个人全部财产向本公司提供连带责任担保。</p>
			<p>4.双方如在本协议执行中发生争议，应友好协商解决，如协商不能解决时，双方均可向本公司住所地有管辖权的人民法院提起诉讼。</p>
			<br/>本协议适用于中华人民共和国颁布的法律、法规以及职能机构的监管规。
		</view>
		<up-button type="primary" style="width: 100%; margin: 50rpx auto;" @click='btnClick'>同意该协议</up-button>
	</view>
</template>

<script setup>
	import { reactive, ref, onMounted, toRefs, unref, inject} from 'vue'
	import config from "@/config/index.js"
	const btnClick = () => {
		uni.navigateBack();
	}
</script>

<style lang="scss" scoped>
	.page{
		background-color: #FFFFFF;
		font-size: 28rpx;
		padding: 32rpx;
	}
</style>
